Tekla Open API Reference for Tekla Structures 2025
Parallel.VectorToPlane Method (Vector, GeometricPlane)
 Returns true if the given vector and plane are parallel.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool VectorToPlane(
	Vector Vector,
	GeometricPlane Plane
)
Public Shared Function VectorToPlane (
	Vector As Vector,
	Plane As GeometricPlane
) As Boolean
Parameters
Vector
Type: Tekla.Structures.Geometry3d.Vector
The vector to be used.
Plane
Type: Tekla.Structures.Geometry3d.GeometricPlane
The plane to be used.
Return Value
Type: Boolean
True if the given vector and plane are parallel.
See Also
Reference
Parallel Class
VectorToPlane Overload
Tekla.Structures.Geometry3d Namespace